using System.Collections.Generic;

namespace AdvantShop.Shipping.Sdek
{
    public class SdekTariffs
    {
        public static readonly List<SdekTariff> Tariffs = new List<SdekTariff>
        {
            // new SdekTariff
            // {
            //     TariffId = 1,
            //     Name = "Экспресс лайт дверь-дверь",
            //     Mode = "Д-Д",
            //     Description = "Классическая экспресс-доставка по России документов и грузов до 30 кг.",
            //     MaxWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 361,
            //     Name = "Экспресс лайт дверь-постамат",
            //     Mode = "Д-П",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MaxWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 363,
            //     Name = "Экспресс лайт склад-постамат",
            //     Mode = "С-П",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MaxWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 5,
            //     Name = "Экономичный экспресс склад-склад",
            //     Mode = "С-С",
            //     Description =
            //         "Недорогая доставка грузов по России ЖД и автотранспортом (доставка грузов с увеличением сроков)."
            // },
            // new SdekTariff
            // {
            //     TariffId = 10,
            //     Name = "Экспресс лайт склад-склад",
            //     Mode = "С-С",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MaxWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 11,
            //     Name = "Экспресс лайт склад-дверь",
            //     Mode = "С-Д",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MaxWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 12,
            //     Name = "Экспресс лайт дверь-склад",
            //     Mode = "Д-С",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MaxWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 15,
            //     Name = "Экспресс тяжеловесы склад-склад",
            //     Mode = "С-С",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MinWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 16,
            //     Name = "Экспресс тяжеловесы склад-дверь",
            //     Mode = "С-Д",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MinWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 17,
            //     Name = "Экспресс тяжеловесы дверь-склад",
            //     Mode = "Д-С",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MinWeight = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 18,
            //     Name = "Экспресс тяжеловесы дверь-дверь",
            //     Mode = "Д-Д",
            //     Description = "Классическая экспресс-доставка по России документов и грузов.",
            //     MinWeight = 30
            // },

            new SdekTariff
            {
                TariffId = 57,
                Name = "Супер-экспресс до 9 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 58,
                Name = "Супер-экспресс до 10 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 59,
                Name = "Супер-экспресс до 12 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 60,
                Name = "Супер-экспресс до 14 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 61,
                Name = "Супер-экспресс до 16 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 3,
                Name = "Супер-экспресс до 18 (дверь-дверь)",
                Mode = "Д-Д",
                Description = "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 777,
                Name = "Супер-экспресс до 12 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 786,
                Name = "Супер-экспресс до 14 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 795,
                Name = "Супер-экспресс до 16 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 804,
                Name = "Супер-экспресс до 18 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 778,
                Name = "Супер-экспресс до 12 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 787,
                Name = "Супер-экспресс до 14 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 796,
                Name = "Супер-экспресс до 16 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 805,
                Name = "Супер-экспресс до 18 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 779,
                Name = "Супер-экспресс до 12 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 788,
                Name = "Супер-экспресс до 14 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 797,
                Name = "Супер-экспресс до 16 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 806,
                Name = "Супер-экспресс до 18 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за сутки).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 62,
                Name = "Магистральный экспресс склад-склад",
                Mode = "С-С",
                Description = "Быстрая экономичная доставка грузов по России"
            },
            new SdekTariff
            {
                TariffId = 63,
                Name = "Магистральный супер-экспресс склад-склад",
                Mode = "С-С",
                Description = "Быстрая экономичная доставка грузов по России"
            },
            // new SdekTariff
            // {
            //     TariffId = 118,
            //     Name = "Экономичный экспресс дверь-дверь",
            //     Mode = "Д-Д",
            //     Description = "Недорогая доставка грузов по России ЖД и автотранспортом (доставка грузов с увеличением сроков)."
            // },
            // new SdekTariff
            // {
            //     TariffId = 119,
            //     Name = "Экономичный экспресс склад-дверь",
            //     Mode = "С-Д",
            //     Description = "Недорогая доставка грузов по России ЖД и автотранспортом (доставка грузов с увеличением сроков)."
            // },
            // new SdekTariff
            // {
            //     TariffId = 120,
            //     Name = "Экономичный экспресс дверь-склад",
            //     Mode = "Д-С",
            //     Description = "Недорогая доставка грузов по России ЖД и автотранспортом (доставка грузов с увеличением сроков)."
            // },
            new SdekTariff
            {
                TariffId = 121,
                Name = "Магистральный экспресс дверь-дверь",
                Mode = "Д-Д",
                Description = "Быстрая экономичная доставка грузов по России"
            },
            new SdekTariff
            {
                TariffId = 122,
                Name = "Магистральный экспресс склад-дверь",
                Mode = "С-Д",
                Description = "Быстрая экономичная доставка грузов по России"
            },
            new SdekTariff
            {
                TariffId = 123,
                Name = "Магистральный экспресс дверь-склад",
                Mode = "Д-С",
                Description = "Быстрая экономичная доставка грузов по России"
            },
            new SdekTariff
            {
                TariffId = 124,
                Name = "Магистральный супер-экспресс дверь-дверь",
                Mode = "Д-Д",
                Description = "Быстрая экономичная доставка грузов к определенному часу"
            },
            new SdekTariff
            {
                TariffId = 125,
                Name = "Магистральный супер-экспресс склад-дверь",
                Mode = "С-Д",
                Description = "Быстрая экономичная доставка грузов к определенному часу"
            },
            new SdekTariff
            {
                TariffId = 126,
                Name = "Магистральный супер-экспресс дверь-склад",
                Mode = "Д-С",
                Description = "Быстрая экономичная доставка грузов к определенному часу"
            },
            //для интернет магазинов
            new SdekTariff
            {
                TariffId = 136,
                Name = "Посылка склад-склад",
                Mode = "С-С",
                Description =
                    "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю.",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 137,
                Name = "Посылка склад-дверь",
                Mode = "С-Д",
                Description =
                    "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю.",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 138,
                Name = "Посылка дверь-склад",
                Mode = "Д-С",
                Description =
                    "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю.",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 139,
                Name = "Посылка дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю.",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 366,
                Name = "Посылка дверь-постамат",
                Mode = "Д-П",
                Description =
                    "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю.",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 368,
                Name = "Посылка склад-постамат",
                Mode = "С-П",
                Description =
                    "Услуга экономичной доставки товаров по России для компаний, осуществляющих дистанционную торговлю.",
                MaxWeight = 30
            },

            new SdekTariff
            {
                TariffId = 231,
                Name = "Экономичная посылка дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю. Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.",
                MaxWeight = 50
            },
            new SdekTariff
            {
                TariffId = 232,
                Name = "Экономичная посылка дверь-склад",
                Mode = "Д-С",
                Description =
                    "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю. Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.",
                MaxWeight = 50
            },
            new SdekTariff
            {
                TariffId = 233,
                Name = "Экономичная посылка склад-дверь",
                Mode = "С-Д",
                Description =
                    "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю. Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.",
                MaxWeight = 50
            },
            new SdekTariff
            {
                TariffId = 234,
                Name = "Экономичная посылка склад-склад",
                Mode = "С-С",
                Description =
                    "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю. Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.",
                MaxWeight = 50
            },
            //new SdekTariff
            //{
            //    TariffId = 376,
            //    Name = "Экономичная посылка дверь-постамат",
            //    Mode = "Д-П",
            //    Description =
            //        "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю. Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.",
            //    MaxWeight = 50
            //},
            new SdekTariff
            {
                TariffId = 378,
                Name = "Экономичная посылка склад-постамат",
                Mode = "С-П",
                Description =
                    "Услуга экономичной наземной доставки товаров по России для компаний, осуществляющих дистанционную торговлю. Услуга действует по направлениям из Москвы в подразделения СДЭК, находящиеся за Уралом и в Крым.",
                MaxWeight = 50
            },


            new SdekTariff
            {
                TariffId = 291,
                Name = "E-com Express склад-склад",
                Mode = "С-С",
                Description =
                    "Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
                MaxWeight = 500
            },

            new SdekTariff
            {
                TariffId = 293,
                Name = "E-com Express дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
                MaxWeight = 500
            },

            new SdekTariff
            {
                TariffId = 294,
                Name = "E-com Express склад-дверь",
                Mode = "С-Д",
                Description =
                    "Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
                MaxWeight = 500
            },

            new SdekTariff
            {
                TariffId = 295,
                Name = "E-com Express дверь-склад",
                Mode = "Д-С",
                Description =
                    "Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
                MaxWeight = 500
            },
            new SdekTariff
            {
                TariffId = 509,
                Name = "E-com Express дверь-постамат",
                Mode = "Д-П",
                Description =
                    "Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
                MaxWeight = 500
            },
            new SdekTariff
            {
                TariffId = 510,
                Name = "E-com Express склад-постамат",
                Mode = "С-П",
                Description =
                    "Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
                MaxWeight = 500
            },
            
            new SdekTariff
            {
                TariffId = 184,
                Name = "E-com Standard дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Стандартная экспресс-доставка. Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
            },
            new SdekTariff
            {
                TariffId = 185,
                Name = "E-com Standard склад-склад",
                Mode = "С-С",
                Description =
                    "Стандартная экспресс-доставка. Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
            },
            new SdekTariff
            {
                TariffId = 186,
                Name = "E-com Standard склад-дверь",
                Mode = "С-Д",
                Description =
                    "Стандартная экспресс-доставка. Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
            },
            new SdekTariff
            {
                TariffId = 187,
                Name = "E-com Standard дверь-склад",
                Mode = "Д-С",
                Description =
                    "Стандартная экспресс-доставка. Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
            },
            new SdekTariff
            {
                TariffId = 497,
                Name = "E-com Standard дверь-постамат",
                Mode = "Д-П",
                Description =
                    "Стандартная экспресс-доставка. Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
            },
            new SdekTariff
            {
                TariffId = 498,
                Name = "E-com Standard склад-постамат",
                Mode = "С-П",
                Description =
                    "Стандартная экспресс-доставка. Сервис по доставке товаров из-за рубежа в Россию, Украину, Казахстан, Киргизию, Узбекистан с услугами по таможенному оформлению",
            },

            new SdekTariff
            {
                TariffId = 7,
                Name = "Международный экспресс документы дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Экспресс-доставка за/из-за границы документов и писем.",
                MaxWeight = 5
            },
            new SdekTariff
            {
                TariffId = 8,
                Name = "Международный экспресс грузы дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Экспресс-доставка за/из-за границы грузов и посылок от 0,5 кг до 30 кг..",
                MaxWeight = 30
            },
            //new SdekTariff
            //{
            //    TariffId = 178,
            //    Name = "Международный экспресс грузы склад-склад",
            //    Mode = "С-С",
            //    Description =
            //        "Экспресс-доставка за/из-за границы грузов и посылок до 30 кг.",
            //    MaxWeight = 30
            //},
            //new SdekTariff
            //{
            //    TariffId = 179,
            //    Name = "Международный экспресс грузы склад-дверь",
            //    Mode = "С-Д",
            //    Description =
            //        "Экспресс-доставка за/из-за границы грузов и посылок до 30 кг.",
            //    MaxWeight = 30
            //},
            //new SdekTariff
            //{
            //    TariffId = 180,
            //    Name = "Международный экспресс грузы дверь-склад",
            //    Mode = "Д-С",
            //    Description =
            //        "Экспресс-доставка за/из-за границы грузов и посылок от 0,5 кг до 30 кг..",
            //    MaxWeight = 30
            //},
            //new SdekTariff
            //{
            //    TariffId = 181,
            //    Name = "Международный экспресс документы склад-склад",
            //    Mode = "С-С",
            //    Description =
            //        "Экспресс-доставка за/из-за границы документов и писем.",
            //    MaxWeight = 5
            //},
            //new SdekTariff
            //{
            //    TariffId = 182,
            //    Name = "Международный экспресс документы склад-дверь",
            //    Mode = "С-Д",
            //    Description =
            //        "Экспресс-доставка за/из-за границы документов и писем.",
            //    MaxWeight = 5
            //},
            //new SdekTariff
            //{
            //    TariffId = 183,
            //    Name = "Международный экспресс документы дверь-склад",
            //    Mode = "Д-С",
            //    Description =
            //        "Экспресс-доставка за/из-за границы документов и писем.",
            //    MaxWeight = 5
            //},
            new SdekTariff
            {
                TariffId = 480,
                Name = "Экспресс дверь-дверь",
                Mode = "Д-Д",
                Description =
                    "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки внутри страны (Россия, Белоруссия, Армения, Киргизия, Казахстан). Также действует по направлениям между странами таможенного союза (Россия, Белоруссия, Армения, Киргизия, Казахстан). Без ограничений по весу",
            },
            new SdekTariff
            {
                TariffId = 481,
                Name = "Экспресс дверь-склад",
                Mode = "Д-С",
                Description =
                    "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки внутри страны (Россия, Белоруссия, Армения, Киргизия, Казахстан). Также действует по направлениям между странами таможенного союза (Россия, Белоруссия, Армения, Киргизия, Казахстан). Без ограничений по весу",
            },
            new SdekTariff
            {
                TariffId = 482,
                Name = "Экспресс склад-дверь",
                Mode = "С-Д",
                Description =
                    "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки внутри страны (Россия, Белоруссия, Армения, Киргизия, Казахстан). Также действует по направлениям между странами таможенного союза (Россия, Белоруссия, Армения, Киргизия, Казахстан). Без ограничений по весу",
            },
            new SdekTariff
            {
                TariffId = 483,
                Name = "Экспресс склад-склад",
                Mode = "С-С",
                Description =
                    "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки внутри страны (Россия, Белоруссия, Армения, Киргизия, Казахстан). Также действует по направлениям между странами таможенного союза (Россия, Белоруссия, Армения, Киргизия, Казахстан). Без ограничений по весу",
            },
            new SdekTariff
            {
                TariffId = 485,
                Name = "Экспресс дверь-постамат",
                Mode = "Д-П",
                Description =
                    "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки внутри страны (Россия, Белоруссия, Армения, Киргизия, Казахстан). Также действует по направлениям между странами таможенного союза (Россия, Белоруссия, Армения, Киргизия, Казахстан). Без ограничений по весу",
            },
            new SdekTariff
            {
                TariffId = 486,
                Name = "Экспресс склад-постамат",
                Mode = "С-П",
                Description =
                    "Классическая экспресс-доставка документов и грузов по стандартным срокам доставки внутри страны (Россия, Белоруссия, Армения, Киргизия, Казахстан). Также действует по направлениям между странами таможенного союза (Россия, Белоруссия, Армения, Киргизия, Казахстан). Без ограничений по весу",
            },
            new SdekTariff
            {
                TariffId = 66,
                Name = "Доставка за 4 часа внутри города пешие (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Доставка заказов от 0 до 15 кг пешими курьерами день в день по Москве и Санкт-Петербургу",
                MaxWeight = 15
            },
            new SdekTariff
            {
                TariffId = 67,
                Name = "Доставка за 4 часа МСК-МО МО-МСК пешие (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Доставка заказов от 0 до 15 кг пешими курьерами день в день по Москве и Московской области (до 10 км от МКАД)",
                MaxWeight = 15
            },
            new SdekTariff
            {
                TariffId = 68,
                Name = "Доставка за 4 часа внутри города авто (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Доставка заказов от 15 кг до 30 кг пешими курьерами день в день по Москве и Санкт-Петербургу ",
                MinWeight = 15,
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 69,
                Name = "Доставка за 4 часа МСК-МО МО-МСК авто (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Доставка заказов от 15 кг до 30 кг пешими курьерами день в день по Москве и Московской области (до 10 км от МКАД",
                MinWeight = 15,
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 676,
                Name = "Супер-экспресс до 10.00 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 677,
                Name = "Супер-экспресс до 10.00 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 678,
                Name = "Супер-экспресс до 10.00 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 679,
                Name = "Супер-экспресс до 10.00 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 686,
                Name = "Супер-экспресс до 12.00 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 687,
                Name = "Супер-экспресс до 12.00 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 688,
                Name = "Супер-экспресс до 12.00 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 689,
                Name = "Супер-экспресс до 12.00 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 696,
                Name = "Супер-экспресс до 14.00 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 697,
                Name = "Супер-экспресс до 14.00 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 698,
                Name = "Супер-экспресс до 14.00 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 699,
                Name = "Супер-экспресс до 14.00 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 706,
                Name = "Супер-экспресс до 16.00 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 707,
                Name = "Супер-экспресс до 16.00 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 708,
                Name = "Супер-экспресс до 16.00 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 709,
                Name = "Супер-экспресс до 16.00 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 716,
                Name = "Супер-экспресс до 18.00 (дверь-дверь)",
                Mode = "Д-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 717,
                Name = "Супер-экспресс до 18.00 (дверь-склад)",
                Mode = "Д-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 718,
                Name = "Супер-экспресс до 18.00 (склад-дверь)",
                Mode = "С-Д",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            new SdekTariff
            {
                TariffId = 719,
                Name = "Супер-экспресс до 18.00 (склад-склад)",
                Mode = "С-С",
                Description =
                    "Срочная доставка документов и грузов «из рук в руки» по России, Казахстану, Беларуси, Армении и Киргизии к определенному часу (доставка за 1-2 суток).",
                MaxWeight = 30
            },
            // new SdekTariff
            // {
            //     TariffId = 243,
            //     Name = "Китайский экспресс склад-склад",
            //     Mode = "С-С",
            //     Description =
            //         "Услуга по доставке из Китая в Россию, Белоруссию и Казахстан. Стоимость разбита по интервалам: - до 200 гр; - каждые последующие 100 гр до 1 кг; - каждый последующий 1кг свыше 1 кг",
            //     //WeightLimitation = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 245,
            //     Name = "Китайский экспресс дверь-дверь",
            //     Mode = "Д-Д",
            //     Description =
            //         "Услуга по доставке из Китая в Россию, Белоруссию и Казахстан. Стоимость разбита по интервалам: - до 200 гр; - каждые последующие 100 гр до 1 кг; - каждый последующий 1кг свыше 1 кг",
            //     //WeightLimitation = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 246,
            //     Name = "Китайский экспресс склад-дверь",
            //     Mode = "С-Д",
            //     Description =
            //         "Услуга по доставке из Китая в Россию, Белоруссию и Казахстан. Стоимость разбита по интервалам: - до 200 гр; - каждые последующие 100 гр до 1 кг; - каждый последующий 1кг свыше 1 кг",
            //     //WeightLimitation = 30
            // },
            // new SdekTariff
            // {
            //     TariffId = 247,
            //     Name = "Китайский экспресс дверь-склад",
            //     Mode = "Д-С",
            //     Description =
            //         "Услуга по доставке из Китая в Россию, Белоруссию и Казахстан. Стоимость разбита по интервалам: - до 200 гр; - каждые последующие 100 гр до 1 кг; - каждый последующий 1кг свыше 1 кг",
            //     //WeightLimitation = 30
            // },
            new SdekTariff
            {
                TariffId = 751,
                Name = "Сборный груз склад-склад",
                Mode = "С-С",
                Description =
                    "Экономичная наземная доставка сборных грузов",
                MaxWeight = 20_000
            },
            new SdekTariff
            {
                TariffId = 533,
                Name = "СДЭК документы дверь-дверь",
                Mode = "Д-Д",
                Description = "Экспресс доставка документов со спец. условием от 90 документов за 90 дней",
                MaxWeight = 0.3f,
            },
            new SdekTariff
            {
                TariffId = 534,
                Name = "СДЭК документы дверь-склад",
                Mode = "Д-С",
                Description = "Экспресс доставка документов со спец. условием от 90 документов за 90 дней",
                MaxWeight = 0.3f,
            },
            new SdekTariff
            {
                TariffId = 535,
                Name = "СДЭК документы склад-дверь",
                Mode = "С-Д",
                Description = "Экспресс доставка документов со спец. условием от 90 документов за 90 дней",
                MaxWeight = 0.3f,
            },
            new SdekTariff
            {
                TariffId = 536,
                Name = "СДЭК документы склад-склад",
                Mode = "С-С",
                Description = "Экспресс доставка документов со спец. условием от 90 документов за 90 дней",
                MaxWeight = 0.3f,
            },
        };

    }

    public class SdekTariff
    {
        public int TariffId { get; set; }
        public string Name { get; set; }
        public string Mode { get; set; }
        public bool Active { get; set; }
        public float? MaxWeight { get; set; }
        public float? MinWeight { get; set; }
        public string Description { get; set; }
        public bool MergeToOnePlace { get; set; }
    }
}